###############################################################
#  Generated by:      Cadence Innovus 18.11-s100_1
#  OS:                Linux x86_64(Host ID eda-host)
#  Generated on:      Tue Jan 10 03:58:20 2023
#  Design:            dsm_dem_top
#  Command:           saveDesign dsm_dem_par.dat
###############################################################
current_design dsm_dem_top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {mclk512}]  -name mclk512 -period 40.000000 -waveform {0.000000 20.000000}
set_propagated_clock  [get_ports {mclk512}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {mclk512}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {mclk512}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {mclk512}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {mclk512}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {reset}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {reset}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {reset}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {reset}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {exchangeLR}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {exchangeLR}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {exchangeLR}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {exchangeLR}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan1[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan1[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan1[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan1[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_chan2[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_chan2[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_chan2[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_chan2[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsm_clr}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsm_clr}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsm_clr}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsm_clr}]
set_load -pin_load -max  0.001  [get_ports {dsm_ovfl}]
set_load -pin_load -min  0.001  [get_ports {dsm_ovfl}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dsmditheroff}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dsmditheroff}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dsmditheroff}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dsmditheroff}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dem_count[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dem_count[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dem_count[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dem_count[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {dem_count[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {dem_count[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {dem_count[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {dem_count[0]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[15]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[15]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[14]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[14]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[13]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[13]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[12]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[12]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[11]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[11]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[10]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[10]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[9]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[9]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[8]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[8]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[7]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[7]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[6]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[6]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[5]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[5]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[4]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[4]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[3]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[3]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[2]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[2]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[1]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[1]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_l[0]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_l[0]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[15]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[15]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[14]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[14]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[13]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[13]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[12]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[12]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[11]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[11]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[10]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[10]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[9]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[9]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[8]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[8]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[7]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[7]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[6]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[6]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[5]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[5]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[4]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[4]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[3]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[3]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[2]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[2]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[1]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[1]}]
set_load -pin_load -max  0.001  [get_ports {dem_out_r[0]}]
set_load -pin_load -min  0.001  [get_ports {dem_out_r[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[20]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[18]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[17]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[21]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[20]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[18]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[19]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[21]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[22]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dem_count[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[19]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[23]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[16]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[22]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dem_count[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsmditheroff}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {reset}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {exchangeLR}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_clr}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[23]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan2[16]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {mclk512}] [get_ports {dsm_chan1[17]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[14]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[12]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[10]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[8]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[9]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[6]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[7]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[4]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[14]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[5]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[2]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[12]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[3]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[0]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[10]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dsm_ovfl}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[1]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[15]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[13]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[11]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[9]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[7]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[8]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[5]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[15]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[6]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[3]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[13]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[4]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[1]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_l[11]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[2]}]
set_output_delay -add_delay 8 -clock [get_clocks {mclk512}] [get_ports {dem_out_r[0]}]
set_dont_use  [get_lib_cells {slow_vdd1v0/HOLDX1}]
