# ####################################################################

#  Created by Genus(TM) Synthesis Solution 18.17-s015_1 on Mon Jan 09 23:40:53 PST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design dsm_dem_top

create_clock -name "mclk512" -period 40.0 -waveform {0.0 20.0} [get_ports mclk512]
set_load -pin_load 0.001 [get_ports dsm_ovfl]
set_load -pin_load 0.001 [get_ports {dem_out_l[15]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[14]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[13]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[12]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[11]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[10]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[9]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[8]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[7]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[6]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[5]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[4]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[3]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[2]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[1]}]
set_load -pin_load 0.001 [get_ports {dem_out_l[0]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[15]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[14]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[13]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[12]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[11]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[10]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[9]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[8]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[7]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[6]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[5]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[4]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[3]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[2]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[1]}]
set_load -pin_load 0.001 [get_ports {dem_out_r[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dem_count[1]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dem_count[0]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports reset]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports exchangeLR]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports dsm_clr]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports dsmditheroff]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[23]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[22]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[21]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[20]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[19]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[18]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[17]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[16]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[15]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[14]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[13]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[12]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[11]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[10]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[9]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[8]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[7]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[6]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[5]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[4]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[3]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[2]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[1]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan1[0]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[23]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[22]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[21]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[20]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[19]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[18]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[17]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[16]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[15]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[14]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[13]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[12]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[11]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[10]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[9]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[8]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[7]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[6]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[5]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[4]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[3]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[2]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[1]}]
set_input_delay -clock [get_clocks mclk512] -add_delay 4.0 [get_ports {dsm_chan2[0]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports dsm_ovfl]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[15]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[14]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[13]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[12]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[11]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[10]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[9]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[8]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[7]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[6]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[5]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[4]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[3]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[2]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[1]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_l[0]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[15]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[14]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[13]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[12]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[11]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[10]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[9]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[8]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[7]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[6]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[5]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[4]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[3]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[2]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[1]}]
set_output_delay -clock [get_clocks mclk512] -add_delay 8.0 [get_ports {dem_out_r[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports mclk512]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports reset]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports exchangeLR]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan1[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[23]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[22]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[21]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[20]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[19]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[18]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[17]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[16]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[15]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[14]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[13]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[12]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[11]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[10]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[9]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[8]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[7]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[6]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[5]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[4]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[3]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[2]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dsm_chan2[0]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports dsm_clr]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports dsmditheroff]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dem_count[1]}]
set_driving_cell -lib_cell INVX12 -library slow_vdd1v0 -pin "Y" [get_ports {dem_count[0]}]
set_wire_load_mode "enclosed"
set_dont_use [get_lib_cells slow_vdd1v0/HOLDX1]
